<%@ page contentType="text/html;charset=UTF-8" %>
<h1>JavaServer Pages (JSP)</h1>
<p> технология Java, предназначенная для создания динамических веб-страниц. JSP предоставляет удобный способ интеграции Java-кода в HTML-страницы, позволяя вам создавать динамические веб-приложения, которые могут взаимодействовать с данными, выполнять сложную логику и динамически формировать веб-страницы.</p>
<ul class="collection">
    <li class="collection-item">

    </li>
    <li class="collection-item">
        Смешивание Java и HTML: JSP позволяют встраивать Java-код в HTML-страницы. Это позволяет вам создавать динамические веб-страницы, включая логику, циклы, условия и другие Java-конструкции, непосредственно в HTML-коде.
    </li>
    <li class="collection-item">
        Расширение .jsp: JSP-файлы обычно имеют расширение .jsp, и они обрабатываются сервером при запросе клиента.
    </li>
    <li class="collection-item">
        Сервлеты под капотом: Когда JSP-файл обрабатывается сервером, он преобразуется в Java-сервлет. Это означает, что вся логика, включая обработку HTTP-запросов и генерацию HTTP-ответов, реализуется как Java-код.
    </li>
    <li class="collection-item">
        Объект request и response: В JSP можно легко получить доступ к объектам HttpServletRequest и HttpServletResponse, что облегчает обработку данных, отправку ответов и взаимодействие с клиентом.
    </li>
    <li class="collection-item">
        Использование тегов: JSP предоставляют специальные теги для вставки Java-кода в HTML-страницы и для выполнения различных задач, таких как объявление переменных, обработка запросов и включение других JSP-файлов.
    </li>
    <li class="collection-item">
        Библиотеки тегов: JSP поддерживают библиотеки тегов, которые позволяют создавать собственные пользовательские теги, делая код более читаемым и поддерживаемым.
    </li>
    <li class="collection-item">
        Сессии и cookies: Вы можете использовать JSP для работы с сеансами пользователя, а также для управления cookies.
    </li>
    <li class="collection-item">
        Легкая интеграция с базами данных: JSP позволяют легко интегрировать базы данных в ваше веб-приложение, используя JDBC или другие технологии доступа к данным.
    </li>
    <li class="collection-item">
        Модульность: Вы можете создавать отдельные JSP-фрагменты и включать их в другие JSP-страницы, обеспечивая повторное использование кода и структуру вашего приложения.
    </li>
</ul>